#include "Header.h"

/*-----------------帮助文档-------------------*/

void helpWord(){

    printf("-----------------------------------------------\n");

    printf("\n1:图书信息管理:\n");
    printf("\ta.显示所有图书:可显示所有图书记录\n");
    printf("\tb.查看指定图书：按提示输入可查找特定书籍\n");
    printf("\tc.添加图书信息记录:按提示输入可新建图书记录\n");
    printf("\td.删除图书信息记录:按提示输入可删除图书记录\n");
    printf("\te.清除所有图书记录:可清空所有图书记录\n\n");
    
    printf("2:读者信息管理:\n");
    printf("\ta.图书借阅信息记录:按提示可添加图书借阅记录\n");
    printf("\tb.图书归还信息记录:按提示可添加图书归还记录\n");
    printf("\tc.读者信息显示:可显示当前所有读者,所有图书借阅记录\n\n");
    
    printf("3.密码修改:\n");
    printf("\t按提示可修改当前账号的密码\n\n");
    
    printf("4:注册账户:\n");
    printf("\t按提示操作可以为本系统添加新用户\n\n");

    printf("-----------------------------------------------\n");

}
